pub fn run() {
    // 标量类型
    // 标量（scalar）类型表示单个值。Rust 有 4 个基本的标量类型：整型、浮点型、布尔型和字符 。
    // 有符号类型可存储的数字范围是 -2^n-1 ~ 2^n-1 -1 其中 n 是该定义形式的位长度。因此 i8 可存储数字范围是 -(27) ~ 27 - 1，即 -128 ~ 127
    // 无符号类型可存储的数字范围是 0 ~ 2^n - 1 其中 n 是该定义形式的位长度。因此 u8 可存储数字范围是 0 ~ 28 - 1，即 0 ~ 255
    // isize 和 usize 位数是取决于cpu 架构 动态改变 如果cpu 32位 那么 他们就为32 如果64位 那么他们就为64
    // Rust 整形默认使用i32
    let _i = 2;
    let a: u8 = 255;
    let b = a.wrapping_add(20);
    println!("{}", b);
    // 浮点类型 默认浮点类型f64
    // 避免在浮点数上测试相等性
    // 当结果在数学上可能存在未定义时，需要格外小心
    let guess: u32 = "42".parse().expect("Not a number!");
    println!("guess: {}", guess);
    let x = 2.0; // f64
    let y: f32 = 3.0; // f32
    let c = 'z';
    let z = 'ℤ';
    let heart_eyed_cat = '😻';
    let x = (-42.0_f32).sqrt();
    if x.is_nan() {
        println!("NaN");
    }
    // 数字运算
    // 编译器自动推导 默认i32
    let twenty = 20;
    // 类型标注
    let twenty_one: i32 = 21;
    // 通过类型后缀来进行标注
    let twenty_two = 32_i32;
    // 同类型可以进行运算
    let addition = twenty + twenty_one + twenty_two;
    // 较长的数字可以进行_分割
    let one_million: i64 = 1_000_000;
    println!(
        "{} + {} + {} = {}",
        twenty, twenty_one, twenty_two, addition
    );
    // 复合类型
    // 复合类型（compound type）可以将多个值组合成一个类型。Rust 有两种基本的复合类型：元组（tuple）和数组（array）。
    let tup = (500, 6.4, 1);

    let (x, y, z) = tup;

    println!("The value of tup is: {}", tup.0);
    println!("The value of y is: {}", y);
    let a: [i32; 5] = [1, 2, 3, 4, 5];
    println!("Array: {:?}", a);
    let a = [3; 5];
    println!("Array: {}", a[2]);
}
